Revit 2027 API
ParameterTypeId.AnalyticalGeometryIsValid Property
 "Analytical Model Correct"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalGeometryIsValid { get; }
Public Shared ReadOnly Property AnalyticalGeometryIsValid As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalGeometryIsValid {
	ForgeTypeId^ get ();
}
static member AnalyticalGeometryIsValid : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace